InformationRegisters/СпециальныеУсловияЗанятостиДолжностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СпециальныеУсловияЗанятостиДолжностей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СпециальныеУсловияЗанятостиДолжностей/Forms/РедактированиеНабораЗаписей/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВедущийОбъект", ВедущийОбъект);
	
	Если НЕ Пользователи.РолиДоступны("ДобавлениеИзменениеДолжностей") Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ТолькоПросмотр Тогда
		ЗарплатаКадрыКлиентСервер.УстановитьРежимТолькоПросмотрВФормеРедактированияИстории(ЭтотОбъект);
	КонецЕсли;
		
	Для Каждого ЗаписьНабора Из Параметры.МассивЗаписей Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ЗаписьНабора);
	КонецЦикла;
	
	Для Каждого Элемент Из РегистрыСведений.СпециальныеУсловияЗанятостиДолжностей.КодыУсловий() Цикл
		Элементы.НаборЗаписейКод.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборЗаписей

&НаКлиенте
Процедура НаборЗаписейПриАктивизацииСтроки(Элемент)
	
	ОбновитьЗначенияПоКоду(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	ОбновитьЗначенияПоКоду(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЗаблокироватьОбъектВФормеВладельце() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередНачаломИзменения(Элемент, Отказ)
	
	Если Не ЗаблокироватьОбъектВФормеВладельце() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередУдалением(Элемент, Отказ)
	
	Если Не ЗаблокироватьОбъектВФормеВладельце() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			Элемент.ТекущиеДанные.Должность = ВедущийОбъект;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные.Код = "" Или ТекущиеДанные.Значение = "" Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого Строка Из НаборЗаписей Цикл
		Если Строка <> ТекущиеДанные И Строка.Код = ТекущиеДанные.Код Тогда
			ПоказатьПредупреждение(,НСтр("ru='Одинаковые коды не допускаются!'"));
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Набор = Новый Массив;
	Для Каждого Элемент Из НаборЗаписей Цикл
		Набор.Добавить(Новый Структура("Код,Значение", Элемент.Код, Элемент.Значение));
	КонецЦикла;
	
	ПараметрОповещения = Новый Структура;
	ПараметрОповещения.Вставить("МассивЗаписей", НаборЗаписей);
	ПараметрОповещения.Вставить("Представление", ПредставлениеНабора(Набор));

	Оповестить("ОтредактированыСпециальныеУсловияЗанятости", ПараметрОповещения, ВедущийОбъект);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЗаблокироватьОбъектВФормеВладельце()
	
	ЭтотОбъект.ВладелецФормы.Модифицированность = Истина;
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначенияКода(Код)
	
	Возврат РегистрыСведений.СпециальныеУсловияЗанятостиДолжностей.ЗначенияКода(Код);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЗначенияПоКоду(Элемент)
	
	Элементы.НаборЗаписейЗначение.СписокВыбора.Очистить();
	
	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ЗначенияКода(ТекущиеДанные.Код) Цикл
		Элементы.НаборЗаписейЗначение.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеНабора(НаборЗаписей)
	
	Возврат РегистрыСведений.СпециальныеУсловияЗанятостиДолжностей.ПредставлениеКоллекцииЗаписей(НаборЗаписей);
	
КонецФункции;

#КонецОбласти
